Repository: l/debian-handbook
Catalog: */00a_preface.po
Languages: id_id, nl_nl, sv_se

source: So Debian is quite unique. Are we the only ones noticing this? Definitely not. According to <ulink url="http://distrowatch.com/">DistroWatch</ulink> there are about 300 active Free Software distributions around. Half of that (about 140) are Debian <emphasis>derivatives</emphasis>. That means that they start from Debian, adapt it to fit the needs of their users — usually by adding, modifying, and rebuilding packages — and release the resulting product. In essence, derivatives apply the Free Software granted freedoms of modifying and redistributing copies not only to individual pieces of software, but to a distribution as a whole. The potential of reaching out to new Free Software users and contributors by the means of derivative distributions is huge. We believe that it is mainly thanks to that thriving ecosystem that Free Software is nowadays finally rivaling with proprietary software in fields which were historically considered hard to conquer, such as large desktop deployments. Debian sits at the root of the largest ecosystem of Free Software distributions in existence: even if you are not using Debian directly, and even if your distributor has not told you, chances are that you are benefiting right now from the work of the Debian community.
id_id: Jadi Debian cukup unik. Apakah kita satu-satunya yang memperhatikan ini? Tentu saja tidak. Menurut <ulink url="http://distrowatch.com/">DistroWatch</ulink> ada sekitar 300 distribusi Software Bebas yang aktif. Setengah dari itu (sekitar 140) adalah turunan <emphasis>Debian</emphasis>. Itu berarti bahwa mereka memulai dari Debian, mengadaptasinya agar sesuai dengan kebutuhan pengguna mereka — biasanya dengan menambahkan, memodifikasi, dan membangun kembali paket — dan melepaskan produk yang dihasilkan. Intinya, turunan menerapkan kebebasan yang diberikan oleh Perangkat Lunak Bebasuntuk memodifikasi dan mendistribusikan ulang salinan tidak hanya ke perangkat lunak individual, namun juga untuk distribusi secara keseluruhan. Potensi untuk menjangkau pengguna Perangkat Lunak Bebas dan kontributor baru melalui distribusi turunan sangat besar. Kami percaya bahwa ini terutama berkat ekosistem yang berkembang bahwa Perangkat Lunak Bebas saat ini akhirnya menandingi perangkat lunak proprietari di bidang yang secara historis dianggap sulit untuk ditaklukkan, seperti penyebaran desktop yang besar. Debian duduk di akar ekosistem terbesar distribusi Perangkat Lunak Bebas yang ada: bahkan jika Anda tidak menggunakan Debian secara langsung, dan bahkan jika distributor Anda belum memberi tahu Anda, kemungkinan besar Anda akan mendapatkan keuntungan dari karya komunitas Debian.
nl_nl: Dus Debian is zeer uniek. Zijn wij de enigen die dit zien? Zeker niet. Volgens <ulink url="http://distrowatch.com/">DistroWatch</ulink> zijn er ongeveer 300 actieve Vrije Software distributies. De helft hiervan (ongeveer 140) zijn <emphasis>afgeleid</emphasis> van Debian. Dit betekend dat ze starten van Debian, het aanpassen naar hun noden — meestal door het toevoegen, aanpassen en opnieuw compileren van pakketten — en het resultaat uitgeven. In essentie passen deze afgeleiden de door Vrije Software geboden mogelijkheid toe om software aan te passen en opnieuw te verspreiden, niet enkel individuele software pakketten, maar als een volledige distributie. Het potentieel om nieuwe Vrij Software gebruikers en ontwikkelaars aan te trekken door deze afgeleide distributies is groot. Wij geloven dat het vooral te danken is aan dit bloeiende ecosysteem dat Vrije Software tegenwoordig eindelijk kan wedijveren met gepatenteerde software in gebieden die historisch gezien moeilijk te overwinnen waren, zoals grote desktop implementaties. Debian zit aan het hart van het grootste ecosysteem van Vrij Software dat er bestaat: zelfs als je Debian niet rechtstreeks gebruikt en zelfs als jouw distributeur het niet heeft verteld, is er een reële kans dat je nu de vruchten plukt van het werk van de Debian gemeenschap.
sv_se: Så Debian är ganska unikt. Är vi de enda som noterat detta? Definitivt inte. Enligt <ulink url="http://distrowatch.com/">DistroWatch</ulink> finns det omkring 300 aktiva distributioner av Fri Programvara. Ungefär hälften (omkring 140) är Debian <emphasis>derivat</emphasis>. Det innebär att de utgått från Debian, anpassat det till behoven hos sina användare — vanligtvis genom att lägga till, modifiera och bygga om paket — och släppa den resulterande produkten. I grund och botten tillämpar derivaten de friheter from Fri Programvara tillåter om att modifiera och återdistribuera kopier int endast för individuella delar av program, men också för en distribution i sin helhet. Potentialen till att nå ut till nya användare av Fri Programvara och bidragsgivare genom distributionsderivat är sort. Vi tror att det är i huvudsak tackvare detta blomstrande ekosystem som Fri Programvara nuförtiden slutligen kan vara i klass med proprietär progrmvara i fält som historiskt ansetts vara svåra att erövra, så som stora skrivbordsinstallationer. Debian finns vid roten av det största ekosystemet av distributioner av Fri Programvara som finns: även om du inte använder Debian direkt, och även om din distributör inte har berättat det för dig är chansen att du just nu drar nytt av Debian-gemenskapens arbete.

source: But Debian's uniqueness sometimes comes with unexpected consequences. A consequence of Debian's vision on digital freedoms has been the need of redefining what we mean by <emphasis>software</emphasis>. The Debian Project has since long realized that, as part of an operating system, you need to distribute a lot of non-software material: music, images, documentation, raw data, firmware, etc. But how do you apply <emphasis>software</emphasis> freedoms to that material? Should we have different requirements or should all material be held up to the same high standard of freedom? The Debian Project has decided for the latter: all material shipped as part of Debian should offer the same freedoms to its users. Such a radical philosophical position has far reaching effects. It means we cannot distribute non-free firmware, or artwork not meant to be used in commercial settings, or books that cannot be modified in order to avoid tarnishing (as book publishers folklore goes) the author's/publisher's reputation.
id_id: Tapi keunikan Debian terkadang disertai konsekuensi tak terduga. Konsekuensi dari visi Debian tentang kebebasan digital adalah kebutuhan untuk mendefinisikan ulang apa yang kita maksud dengan <emphasis>perangkat lunak</emphasis>. Proyek Debian sejak lama menyadari bahwa, sebagai bagian dari sistem operasi, Anda perlu mendistribusikan banyak materi non-perangkat lunak: musik, gambar, dokumentasi, data mentah, firmware, dll. Tetapi bagaimana Anda menerapkan kebebasan <emphasis>perangkat lunak</emphasis> untuk materi itu? Haruskah kita memiliki persyaratan yang berbeda atau haruskah semua materi dipertahankan sesuai dengan standar kebebasan yang sama? Proyek Debian telah memutuskan yang terakhir: semua materi yang dikirim sebagai bagian dari Debian harus menawarkan kebebasan yang sama kepada penggunanya. Posisi filosofis radikal semacam itu memiliki efek yang jauh. Artinya, kita tidak bisa mendistribusikan firmware tanpa barang, atau karya seni yang tidak dimaksudkan untuk digunakan dalam lingkungan komersial, atau buku yang tidak dapat diubah agar tidak menodai (seperti cerita cerita penerbit buku) reputasi penulis/penerbit.
nl_nl: Maar de uniekheid van Debian heeft soms onverwachte consequenties. Een consequentie van de visie van Debian op digitale vrijheden heeft ervoor gezorgd dat we onze mening over wat <emphasis>software</emphasis> is moeten herzien. Het Debian Project heeft reeds lang gerealiseerd dat, als een deel van een besturingssysteem, je ook een heleboel niet-software moet bundelen zoals: muziek, afbeeldingen, documentatie, ruwe data, firmware, enz. Maar pas je de <emphasis>software</emphasis> vrijheden toe op al dit materiaal? Zouden we andere vereisten hanteren of zouden we dezelfde hoge vrije standaard toepassen? Het Debian Project heeft gekozen voor het laatste: alles wat als een deel van Debian verspreid wordt zou dezelfde vrijheden moeten bieden aan zijn gebruikers. Zo'n radicale filosofie heeft verstrekkende gevolgen. Het betekend dat we geen niet-vrije firmware, of afbeeldingen die niet bedoeld zijn voor commerciële doeleinden kunnen bundelen. Of boeken die niet aangepast kunnen worden om de reputatie van (zoals de uitgevers folklore verteld) de auteurs/uitgevers niet te bezoedelen.
sv_se: Men Debians unikhet får stundtals oväntade konsekvenser. En konsekvens av Debians vision om digital frihet har varit behovet av att omdefiniera vad vi menar med <emphasis>programvara</emphasis>. Debian-projektet har sedan länge insett att som en del av ett operativsystem måste du distribuera massor av icke-fritt material: musik, bilder, dokumentation, rådata, fastprogramvara, etc. Men hur tillämpar man friheter för <emphasis>programvara</emphasis> för detta material? Ska vi ha olika krav eller ska allt material hållas till samma höga standard av frihet? Debian-projektet har beslutat det senare: allt material som skeppas som en del av Debian bör erbjuda samma friheter till sina användare. En sådan radikal filosofiskt position har långtgående effekter. Det innebär att vi inte kan distribuera icke-fri fastprogramvara, eller konstverk som inte får användas i en kommersiell miljö, eller böcker som inte kan modifieras för att undvika att skamfila författarens/förläggarens rykte (enligt tron hos bokförläggare).

source: The book you have in your hands is different. It's a <emphasis>free as in freedom</emphasis> book, a book which is up to Debian freedom standards for every aspect of your digital life. For a very long time, the scarce availability of books like this one has been a significant shortcoming of Debian. It meant that there was little reading material that helped to spread Debian and its values, while at the same time embodying those values and showing off their advantages. But it also meant, ironically, that we had little such material that we could distribute as part of Debian itself. This is the first reputable book to address this shortcoming. You can <command>apt install</command> this book, you can redistribute it, you can fork this book or, better, submit bug reports and patches for it, so that others in the future can benefit from your contributions. The “maintainers” of this book — who are also its authors — are longstanding members of the Debian Project, who grok the freedom ethos that permeates every aspect of Debian and know first-hand what it means to take on the responsibility for important parts of Debian. By releasing this Free book they are doing, once more, such a wonderful service to the Debian community.
id_id: Buku yang ada di tangan Anda berbeda. Ini adalah buku <emphasis>free dalam arti kebebasan</emphasis>, buku yang sesuai dengan standar kebebasan Debian untuk setiap aspek kehidupan digital Anda. Untuk waktu yang sangat lama, ketersediaan buku yang langka seperti ini telah menjadi kelemahan Debian yang signifikan. Itu berarti ada sedikit bahan bacaan yang membantu menyebarkan Debian dan nilainya, sementara pada saat bersamaan mewujudkan nilai-nilai itu dan memamerkan keuntungan mereka. Tapi itu juga berarti, ironisnya, kami hanya memiliki sedikit materi yang bisa kami distribusikan sebagai bagian dari Debian itu sendiri. Ini adalah buku berreputasi pertama yang menangani kekurangan ini. Anda bisa <command>apt install</command> buku ini, Anda dapat mendistribusikannya kembali, Anda dapat meminta buku ini atau, lebih baik, mengirimkan laporan bug dan tambalan untuknya, sehingga orang lain di masa depan dapat memperoleh manfaat dari kontribusi Anda. "Para pemelihara" buku ini — yang juga pengarangnya — adalah anggota lama Proyek Debian, yang menggabungkan etos kebebasan yang menembus setiap aspek Debian dan mengetahui secara langsung apa artinya bertanggung jawab atas bagian penting dari Proyek Debian. Dengan merilis buku Bebas ini mereka melakukan, sekali lagi, layanan yang luar biasa bagi komunitas Debian.
nl_nl: Het boek in jouw handen is anders. Het is een <emphasis>Vrij als in vrijheid</emphasis> boek, een boek dat voldoet aan de Debian vrijheids standaarden voor elk aspect van uw digitale leven. Voor een zeer lange tijd was de schaarse beschikbaarheid van boeken zoals dit een grote tekortkoming van Debian. Het betekend dat er weinig lees-materiaal was om Debian en zijn waarden te verspreiden, en op het zelfde moment deze waarden te vertegenwoordigen en de voordelen aan te tonen. Maar het betekende ook, ironisch genoeg, dat we weinig van dit materiaal hadden dat we konden distribueren als een onderdeel van Debian zelf. Dit is het eerste respectabele boek dat deze tekortkoming aankaart. Je kunt dit boek installeren <command>apt install</command>, je kunt het herdistribueren, je kunt een nieuw boek van dit boek afsplitsen of nog beter, fouten en aanpassingen rapporteren zodat anderen in de toekomst kunnen genieten van jouw bijdrage. De "onderhouders" van dit boek — die ook de auteurs zijn — zijn langdurige leden van het Debian Project, die de etos van vrijheid uitdragen, welke uit ieder aspect van Debian doordringt en weten uit ervaring wat het betekend om de verantwoordelijkheid op te nemen voor belangrijke delen van Debian. Door het vrijgeven van dit Vrije boek bewijzen ze, eens te meer, een enorme dienst aan de Debian gemeenschap.
sv_se: Boken du har i dina händer är annorlunda. Det är en bok som är <emphasis>fri som i frihet</emphasis>, en bok som upprätthåller Debians standard för frihet i varje aspekt av ditt digitala liv. Under en väldigt lång tid har den knappa tillgängligheten på böcker som denna varit en väsentlig brist hos Debian. Det innebar att det fanns lite läsbart material som hjälpte till att sprida Debian och dess värderingar, samtidigt som det förkroppsligar dessa värden och påvisar deras fördelar. Det innebar också, ironiskt nog, att vi har väldigt lite sådant material att distribuera som en del av Debian självt. Detta är den första välrenommerade boken som åtgärdar denna brist. Du kan <command>apt install</command>:era denna bok, du kan återdistribuera den, du kan fork:a denna boken eller, ännu bättre, bidra med felrapporter och fixar för den så att andra i framtiden kan dra fördel av dina bidrag. ”Underhållarna” av denna bok — som också är dess författare — är långvariga medlemma i Debian-projektet, som förstår att frihetens etos genomsysrar varje del av Debian och har förstahandserfarenhet om var det innebär att ta på sig ansvar för viktiga delar av Debian. Genom att släppa denna Fria bok gör de än en gång Debian-gemenskapen en tjänst.

source: We hope you will enjoy this cornerstone of Debian reading Freedom as much as we did.
id_id: Kami berharap Anda akan menikmati batu penjuru Kebebasan membaca Debian seperti yang kami lakukan.
nl_nl: Wij hopen dat je aan het lezen van deze hoeksteen van Debian lees Vrijheid net zoveel plezier zult beleven als wij.
sv_se: Vi hoppas att du kommer att njuta av denna hörnsten av Debian-läsningsfrihet lika mycket som vi gjort.

source: October 2015
id_id: Oktober 2015
nl_nl: oktober 2015
sv_se: Oktober 2015

source: Stefano Zacchiroli (Debian Project Leader 2010-2013), Lucas Nussbaum (Debian Project Leader 2013-2015) and Neil McGovern (Debian Project Leader 2015-incumbent)
id_id: Stefano Zacchiroli (Pemimpin Proyek Debian 2010-2013), Lucas Nussbaum (Pemimpin Proyek Debian 2013-2015) dan Neil McGovern (Pemimpin Proyek Debian 2015-sekarang)
nl_nl: Stefano Zacchiroli (Debian Project Leider 2010-2013), Lucas Nussbaum (Debian Project Leider 2013-2015) en Neil McGovern (Debian Project Leider 2015-vandaag)
sv_se: Stefano Zacchiroli (Debian-projektets ledare 2010-2013), Lucas Nussbaum (Debian-projektets ledare 2013-2015) och Neil McGovern (Debian-projektets ledare 2015-sittande)
