Repository: l/debian-handbook
Catalog: */00a_preface.po
Languages: id_id, nl_nl, sv_se

source: Preface
id_id: Prakata
nl_nl: Introductie
sv_se: Försättsblad

source: Debian is a very successful operating system, which is pervasive in our digital lives more than people often imagine or are aware of. A few data points will suffice to make this clear. At the time of writing Debian is the most popular GNU/Linux variant among web servers: according to <ulink url="http://w3techs.com/">W3Techs</ulink>, more than 10% of the web is Debian-powered. Think about it: how many web sites would have you missed today without Debian? Onto more fascinating deployments, Debian is the operating system of choice on the International Space Station. Have you been following the work of ISS astronauts, maybe via the social network presence of NASA or other international organizations? Both the work in itself and the posts about it have been made possible by Debian. Countless companies, universities, and public administrations rely on Debian daily for their operations, delivering services to millions of users around the world... and its orbit!
id_id: Debian adalah sistem operasi yang sangat sukses, yang merambah dalam kehidupan digital kita lebih dari yang sering kita bayangkan atau sadari. Beberapa fakta cukup untuk menjelaskan hal ini. Pada saat penulisan (buku ini), Debian adalah varian GNU/Linux yang paling populer di antara web server: menurut <ulink url="http://w3techs.com/">W3Techs</ulink>, lebih dari 10% dari web menggunakan Debian sebagai servernya. Coba kita pikirkan hal ini: berapa banyak situs web yang akan Anda lewatkan hari ini tanpa Debian? Dan yang lebih menarik, Debian adalah sistem operasi yang dipilih untuk digunakan pada Stasiun Luar Angkasa Internasional. Apakah Anda pernah mengikuti perkembangan dari astronot di Stasiun Luar Angkasa Internasional (ISS), mungkin melalui kehadiran jaringan sosial NASA atau organisasi internasional lainnya? Kedua hal itu sendiri dan tulisan tentang hal itu telah dimungkinkan oleh Debian. Perusahaan yang tak terhitung jumlahnya, universitas, dan administrasi publik bergantung pada Debian untuk pekerjaan mereka, memberikan layanan kepada jutaan pengguna di seluruh dunia... dan juga orbitnya!
nl_nl: Debian is een zeer succesvol besturingssysteem, dat meer in onze digitale levens is doorgedrongen dan waar de meeste mensen zich van bewust zijn. Enkele punten zullen genoeg moeten zijn om dit duidelijk te maken. Op het moment van schrijven is Debian de populairste GNU/Linux variant onder de web servers: volgens <ulink url="http://w3techs.com/">W3Techs</ulink>, is meer dan 10% van het web door Debian aangedreven. Denk er eens over na: hoeveel web sites zou je vandaag moeten missen zonder Debian? Op naar meer fascinerende gebruikers, Debian is het besturingssysteem naar keuze op het International Space Station (ISS). Heb je het werk van de ISS astronauten gevolgd, misschien volgens de aanwezigheid van NASA of andere internationale organisaties op de sociale netwerken? Zowel het werk zelf als de berichten erover zijn mogelijk gemaakt door Debian. Ontelbare bedrijven, universiteiten en publieke administraties rekenen dagelijks op Debian om hun diensten aan te bieden aan miljoenen gebruikers over de hele wereld... en in een baan eromheen!
sv_se: Debian är ett väldigt framgångsrikt operativsystem, vilket ofta präglar våra digital liv mer än människor kan tänka sig eller är medvetna om. Ett fåtal datapunkter räcker för att klargöra detta. Vid tiden för publikation av detta dokument är Debian den mest populära GNU/Linux-varianten bland webbservrar: enligt <ulink url="http://w3techs.com/">W3Techs</ulink>, mer än 10% av webben använder Debian. Tänk på det: hur många webbplatser hade du saknat idag utan Debian? Vidare till mer fascinerande installationer, Debian är operativsystemet som användas på den internationella rymdstationen ISS. Har du följt arbetet som ISS-astronauter utför, kanske via sociala nätverk hos NASA eller andra internationella organisationer? Både arbetet i sig och posterna om det har gjorts möjliga av Debian. Oräkneliga företag, universitet och offentliga förvaltningar litar till Debian för deras dagliga uppgifter, vilket levererar tjänster till miljoner av användare runtom i världen… och i omloppsbana!

source: But Debian is much more than an operating system, no matter how complex, featureful, and reliable such a system could be. Debian is a vision of the freedoms that people should enjoy in a world where more and more of our daily activities depend on software. Debian is born from the cardinal Free Software idea that people should be in control of their computers, and not the other way around. People with enough software knowledge should be able to dismantle, modify, reassemble and share with others all the software that matters to them. It doesn't matter if the software is used for frivolous activities like posting pictures of kittens on the Web, or for potentially life-threatening tasks such as driving our cars and powering the medical devices which cure us — and Debian is used in all of the above scenarios; you should control it. People without in-depth software knowledge should enjoy those freedoms too: they should be able to delegate to people of their choice, people they trust, the audit or modification of software-based devices on their behalf.
id_id: Tapi Debian jauh lebih dari sebuah sistem operasi, tidak peduli bagaimana kompleks, penuh fitur, dan dapat diandalkan sistem seperti bisa. Debian adalah visi kebebasan bahwa orang harus menikmati di dunia di mana semakin banyak kegiatan sehari-hari tergantung pada perangkat lunak. Debian lahir dari kardinal Software Gratis gagasan bahwa orang harus mengendalikan komputer mereka, dan bukan sebaliknya. Orang dengan pengetahuan software yang cukup harus dapat membongkar, memodifikasi, berkumpul kembali dan berbagi dengan orang lain semua perangkat lunak yang penting bagi mereka. Tidak masalah jika software yang digunakan untuk kegiatan sembarangan seperti posting gambar anak kucing di Web, atau untuk tugas-tugas yang berpotensi mengancam kehidupan seperti - mengemudikan mobil kami dan menyalakan perangkat medis untuk menyembuhkan kita - dan Debian digunakan dalam semua skenario di atas; Anda harus mengendalikannya. Orang tanpa pengetahuan software yang mendalam harus menikmati kebebasan tersebut juga: mereka harus dapat mendelegasikan kepada orang-orang pilihan mereka, orang yang mereka percaya, audit atau modifikasi perangkat-perangkat lunak berbasis atas nama mereka.
nl_nl: Maar Debian is veel meer dan een besturingssysteem, het maakt niet uit hoe complex, met hoeveel mogelijkheden, en hoe betrouwbaar zo'n systeem zou kunnen zijn. Debian is een visie van de vrijheden welke mensen zouden moeten genieten in een wereld waar ons dagelijkse leven meer en meer afhangt van software. Debian is geboren uit het fundamentele Vrije Software idee dat mensen controle moeten hebben over hun computer, en niet omgekeerd. Mensen met genoeg software kennis zouden alle software die er voor hen toe doet moeten kunnen ontmantelen, aanpassen, weer in elkaar steken en delen met anderen. Het maakt niet uit of de software wordt gebruikt voor frivole activiteiten zoals foto's van katjes op het net zetten of om mogelijke levensbedreigende taken zoals het besturen van onze auto's of het aandrijven van medische apparaten die ons genezen uit te voeren — en Debian wordt in alle bovenstaande gevallen gebruikt; jij zou het moeten besturen. Mensen zonder diepgaande software kennis zouden ook van deze vrijheden moeten kunnen genieten: Zij zouden de mogelijkheid moeten hebben om mensen naar hun keuze, mensen die zij vertrouwen, in hun naam de of software gebaseerd apparaten te bekijken en aan te passen.
sv_se: Men Debian är mycket mer än ett operativsystem, oavsett hur komplext, funktionsrikt och tillförlitligt ett sådant system än är. Debian är en vision av frihetern som människor bör kunna åtnjuta i en värld där fler och fler av våra dagliga aktiviteter beror på programvara. Debian är sprunget från avgörande idén om Fri Programvara, att människor bör kunna styra sina datorer, och inte tvärtom. Människor med tillräckligt med kunskap om programvara bör kunna montera isär, modifiera, återmontera programvaran och dela med sig av den programvara som spelar roll för dem. Det spelar ingen roll om programvaran används för oseriöska aktiviteter som att posta bilder på katter på internet, eller om det används för livshotande uppgifter som att köra våra bilder och driva de medicinska enheter som botar oss — Debian används i alla av de ovanstående fallen; du bör kunna styra det. Människor utan djupgående programvarukunskap bör också kunna åtnjuta dessa friheterna: de bör kunna delegera till människor som de väljer, människor som de litar på, som kan underhålla eller modifiera de programvarubaserade enheterna åt dem.

source: In the quest for the control of people over machines, Free operating systems play a fundamental role: you cannot be in full control of a computer device if you do not control its operating system. This is where Debian's main ambition comes from: producing the best, entirely Free operating system. For more than 20 years now, Debian has both developed a Free operating system and promoted a vision of Free Software around it. In so doing, Debian has set a very high bar for software freedom advocates around the world. Debian's decisions on matters of software licensing, for example, are routinely looked to by international standard organizations, governments, and other Free Software projects, when deciding if something should be considered “free enough” or not.
id_id: Dalam pencarian kontrol orang atas mesin, sistem operasi Bebas memainkan peran mendasar: Anda tidak dapat mengendalikan sepenuhnya perangkat komputer jika Anda tidak mengendalikan sistem operasinya. Dari sinilah asal ambisi utama Debian: menghasilkan sistem operasi Bebas yang terbaik. Selama lebih dari 20 tahun sekarang, Debian telah mengembangkan sistem operasi Bebas dan mempromosikan visi Perangkat Lunak Bebas di sekitarnya. Dengan melakukan hal itu, Debian telah menetapkan sebuah patokan yang sangat tinggi untuk pendukung kebebasan perangkat lunak di seluruh dunia. Keputusan Debian mengenai masalah perizinan perangkat lunak, misalnya, secara rutin dilihat oleh organisasi standar internasional, pemerintah, dan proyek Perangkat Lunak Bebas lainnya, saat memutuskan apakah sesuatu harus dianggap "cukup bebas" atau tidak.
nl_nl: In de zoektocht naar controle van de mens over de machines spelen Vrije besturingssystemen een fundamentele rol: Je kunt geen volledige controle hebben over een computer als je geen controle hebt over zijn besturingssysteem. Hier komt de grootste ambitie van Debian: Het maken van het beste, volledig Vrije besturingssysteem. Nu al voor meer dan 20 jaar heeft Debian zowel een Vrij besturingssysteem ontwikkeld als de visie van Vrije software eromheen gepromoot. Zodoende heeft Debian de lat zeer hoog gelegd voor de advocaten van Vrije Software wereldwijd. De keuzes van Debian voor wat software licenties betreft bijvoorbeeld, worden regelmatige bekeken door internationale standaardiserings-organisaties, overheden, en andere Vrije software projecten als ze we willen kijken of iets als "Vrij genoeg" beschouwd kan worden of niet.
sv_se: I sökandet efter att människor ska kunna kontrollera maskiner spelar Fria operativsystem en fundamental roll: du kan inte vara i fullständig kontroll av en datorenhet om du inte styr över dess operativsystem. Detta är varifrån huvudambitionen för Debian kommer ifrån: att producera det bästa, fullständigt fria operativsystemet. Under mer än 20 år har Debian både utvecklat ett Fritt operativsystem och främjat en vision av Fri Programvara runt det. Genom att göra detta har Debian satt en väldigt hög ribba för förespråkare av programvarufrihet i världen. Debians beslut kring programvarulicensiering studeras till exempel rutinmässigt av internationella standardorganisationer, regeringar och andra projekt för Fri Programvara, när det ska beslutas om någon ska anses vara ”tillräckligt fritt” eller ej.

source: But this political vision is not yet enough to explain Debian's uniqueness. Debian is also a very peculiar social experiment, strongly attached to its independence. Think for a moment of other mainstream Free Software distributions, or even of popular <emphasis>proprietary</emphasis> operating systems. Chances are that you can associate each of them with a large company that is either the main development force behind the project, or at the very least the steward of all its non-development activities. Debian is different. Within the Debian Project volunteers pack on themselves the responsibilities of all the activities that are needed to keep Debian alive and kicking. The variety of those activities is stunning: from translations to system administration, from marketing to management, from conference organization to artwork design, from bookkeeping to legal issues... not to mention software packaging and development! Debian contributors take care of all of these.
id_id: Tapi visi politik ini belum cukup untuk menjelaskan keunikan Debian. Debian juga merupakan eksperimen sosial yang sangat aneh, melekat kuat pada kemandiriannya. Pikirkan sejenak distribusi Perangkat Lunak Bebas arus utama lainnya, atau bahkan sistem operasi <emphasis>proprietary</emphasis> yang populer. Kemungkinan besar Anda bisa mengaitkan mereka dengan perusahaan besar yang merupakan kekuatan pengembangan utama di balik proyek ini, atau paling tidak sebagai penatalayan dari semua kegiatan non-pengembangannya. Debian berbeda. Dalam Proyek Debian para relawan mengemas tanggung jawab pada diri mereka sendiri semua aktivitas yang diperlukan agar Debian tetap hidup dan menendang. Berbagai kegiatan tersebut menakjubkan: mulai dari terjemahan hingga administrasi sistem, dari pemasaran hingga manajemen, dari organisasi konferensi sampai desain karya seni, dari pembukuan hingga masalah hukum ... belum lagi pemaketan dan pengembangan perangkat lunak! Kontributor Debian mengurus semua ini.
nl_nl: Maar deze politieke visie is nog niet genoeg om de uniekheid van Debian uit te leggen. Debian is ook een zeer eigenaardig sociaal experiment, sterk verbonden aan zijn onafhankelijkheid. Denk even aan andere "mainstream" Vrije Software distributies, of zelf populaire <emphasis>gepatenteerde</emphasis> besturingssystemen. De kans is groot dat je ze kunt associëren met grote bedrijven die ofwel de grote kracht achter de ontwikkeling van het project zijn of ten minste de rentmeester zijn van al zijn niet-ontwikkel activiteiten. Debian is anders. Binnen in het Debian project nemen de vrijwilligers zelf de verantwoordelijkheid voor al de activiteiten die nodig zijn om Debian springlevend te houden. De diversheid van deze activiteiten is verbazing wekkend: van vertalingen tot systeem beheer, van marketing tot management, van het organiseren van evenementen tot grafisch ontwerp, van boekhouding tot legale kwesties... om nog maar te zwijgen over het inpakken en ontwikkelen! De bijdragers van Debian nemen al deze taken voor hun rekening.
sv_se: Men denna politiska vision är inte tillräcklig för att förklara varför Debian är unikt. Debian är också ett väldigt speciellt socialt experiment, vilket är starkt knutet till dess oberoende. Tänk en stund på andra vanliga distributioner av Fri Programvara, eller till och med populära <emphasis>proprietära</emphasis> operativsystem. Chansen är att du kan associera vart och ett av dem med ett stort företag som antingen står för huvudutvecklinga bakom projektet, eller åtminstone agerar förvaltare för alla dess aktiviteter som inte rör utveckling. Debian är annorlunda. Inom Debian-projektet tar frivilliga på sig ansvar för alla de aktiviteter som behövs för att hålla Debian levande. Variationen bland dessa aktiviteter är slående: från översättningar till systemadministration, från marknadsföring till förvaltning, från organisation av konferenser till design av konstverk, från bokföring till legala problem… programvarupaketering och utveckling inte att förglömma! Debian bidragsgivare tar hand om allt detta.

source: As a first consequence of this radical form of independence, Debian needs and relies on a very diverse community of volunteers. Any skill in any of the above areas, or others you can imagine, can be invested into Debian and will be used to improve the project. A second consequence of Debian independence is that Debian's choices can be trusted not to be driven by the commercial interests of specific companies — interests that we have no guarantee will always be aligned with the goal of promoting people's control over machines, as too many recent examples in the tech news testify.
id_id: Sebagai konsekuensi pertama dari bentuk kemerdekaan radikal ini, Debian memerlukan dan bergantung pada komunitas relawan yang sangat beragam. Setiap keahlian di bidang-bidang di atas, atau yang lain yang dapat Anda bayangkan, dapat diinvestasikan ke Debian dan akan digunakan untuk memperbaiki proyek. Konsekuensi kedua dari independensi Debian adalah bahwa pilihan Debian dapat dipercaya untuk tidak didorong oleh kepentingan komersial dari perusahaan tertentu — kepentingan yang tidak dapat kita jaga akan selalu sesuai dengan tujuan untuk mempromosikan kontrol orang terhadap mesin, sebagaimana diungkapkan dalam terlalu banyak contoh terkini di berita-berita teknologi.
nl_nl: Als eerste consequentie van deze radicale vorm van onafhankelijkheid moet Debian kunnen rekenen op een zeer diverse gemeenschap van vrijwilligers. Iedere kennis in bovengenoemde velden of andere die je kunt inbeelden, kan geïnvesteerd worden in Debian en zal gebruikt worden om het project te verbeteren. Een tweede consequentie van de onafhankelijkheid van Debian is dat je er op kunt vertrouwen dat de keuzen van Debian niet gedreven worden door commerciële belangen van bepaalde bedrijven — belangen waarvan we geen garantie hebben dat ze in lijn liggen met het doel op het promoten van de controle van de mens over machines, zoals te veel recente voorbeelden uit de technologie aantonen.
sv_se: Som en första konsekvens av denna radiakal form av oberoende behöver och förlitar sig Debian på en vädligt mångfaldig gemenskap av frivilliga. Vilken färdighet som helst inom något av de ovanstående områedena, eller andra som du kan hitta på, kan investeras i Debian och kommer att användas för att förbättra projektet. En andra konsekvens av Debians oberoende är att man kan förlita sig på att Debians val inte drivs av kommersiella intressen från specifika företag — intressen som vi inte har några garantier för att de alltid kommer att vara i linje med målet att förespråka människors kontroll över maskiner, vilket alltför många färska exempel i tekniknyheter vittnar om.

source: One last aspect contributes to Debian's uniqueness: the way in which the social experiment is run. Despite the folklore of being bureaucratic, decision making in Debian is in fact highly distributed. There exist clearly defined areas of responsibility within the project. People in charge of those areas are free to drive their own boat. As long as they keep up with the quality requirements agreed upon by the community, no one can tell them what to do or how to do their job. If you want to have a say on how something is done in Debian, you need to put yourself on the line and be ready to take the job on your shoulders. This peculiar form of meritocracy — which we sometimes call <emphasis>do-ocracy</emphasis> — is very empowering for contributors. Anyone with enough skills, time, and motivation can have a real impact on the direction the project is taking. This is testified by a population of about 1 000 official members of the Debian Project, and several thousands of contributors world-wide. It is no wonder that Debian is often credited as the largest community-driven Free Software project in existence.
id_id: Salah satu aspek terakhir berkontribusi pada keunikan Debian: cara eksperimen sosial dijalankan. Meskipun cerita rakyatnya birokratis, pengambilan keputusan di Debian sebenarnya sangat terdistribusi. Ada area tanggung jawab yang jelas dalam proyek ini. Orang-orang yang bertanggung jawab atas wilayah-wilayah itu bebas untuk mengendarai kapal mereka sendiri. Selama mereka mengikuti persyaratan kualitas yang disepakati oleh masyarakat, tidak ada yang bisa memberi tahu mereka apa yang harus dilakukan atau bagaimana melakukan pekerjaan mereka. Jika Anda ingin mengatakan bagaimana sesuatu dilakukan di Debian, Anda perlu menempatkan diri Anda di garis depan dan siap untuk mengambil alih pekerjaan ke pundak Anda. Bentuk meritokrasi yang aneh ini — yang terkadang kita sebut <emphasis>do-ocracy</emphasis> — sangat memberdayakan kontributor. Siapapun yang memiliki keterampilan, waktu, dan motivasi yang cukup dapat memiliki dampak nyata pada arah yang diambil proyek. Hal ini ditunjukkan oleh populasi sekitar 1.000 anggota resmi Proyek Debian, dan beberapa ribu kontributor di seluruh dunia. Tidak mengherankan bahwa Debian sering dipuji sebagai proyek Perangkat Lunak Bebas berbasis komunitas terbesar yang ada.
nl_nl: Nog één laatste aspect dat bijdraagt aan de uniekheid van Debian: de manier waarop het sociale experiment draait. Desondanks de folklore dat Debian bureaucratisch zou zijn, is de besluitvorming in Debian in feite zeer gedistribueerd. Er bestaan duidelijk gedefinieerde gebieden van verantwoordelijkheid binnen het project. De mensen die verantwoordelijk zijn voor deze gebieden zijn vrij om hun eigen koers te varen. Zolang ze de hoge kwaliteitseisen afgesproken door de gemeenschap blijven handhaven kan niemand hen commanderen wat te doen. Als je zeggenschap wil hebben in iets wat Debian doet, moet je zelf initiatief nemen en klaar zijn om de taak op jouw schouders te nemen. Deze vreemde soort meritocracy — welke we soms ook <emphasis>doe-ocracy</emphasis> — noemen geeft veel macht aan de bijdragers. Iedereen die bekwaam is, tijd en motivatie heeft kan een echte impact hebben op de richting het project neemt. Getuige hiervan de gemeenschap met ongeveer 1.000 officiële leden van het Debian Project en enkele duizenden mensen die bijdragen wereld-wijd. Het is geen wonder dat Debian vaak genoemd wordt als het grootste gemeenschaps-gedreven Vrije Software project dat er bestaat.
sv_se: En sista aspekt bidrar till att göra Debian unikt: sättet på vilket det sociala experimentet drivs. Trots tron om att det är byråkratiskt, är beslutsfattande inom Debian faktiskt väldigt distribuerat. Det existerar tydligt definierade områden av ansvar inom projektet. Människor som är ansvariga för dessa områden kan fritt köra sin egen båt. Så länge som de håller jämna steg med kvalitetskraven som beslutats om av gemenskapen så kan inte berätta för dem vad de ska göra eller hur de ska göra sitt jobb. Om du vill ha ord med i om hur något ska göras i Debian måste du ta en risk och var redo att ta på dig jobbet själv. Denna egendomliga form av meritokrati — som ibland kallas <emphasis>gör-okrati</emphasis> — är väldigt berikande för bidragsgivarna. Vem som helst med tillräckligt med färdigheter, tid och motivation kan ha en väsentlig inverkan på riktningen projektet tar. Detta vittnars om av en samling av ungefär 1000 officiella medlemmar i Debian-projektet, och flera tusen bidragsgivare runt om i världen. Det är inte konstigt att Debian ofta omtalas om det största existerande gemenskapsdrivna projektet för Fri Programvara.
